# PANDAS

In [1]:
import numpy as np

import pandas as pd

#### Creating a Series by passing a list of values, letting pandas create a default integer index

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

#### Creating a DataFrame by passing a NumPy array, with a datetime index and labeled columns

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.041664 -0.316782  0.260291  0.758196
2013-01-02  0.010993 -0.793263 -0.493612  0.598263
2013-01-03  0.686346 -0.751067 -0.968779  0.105456
2013-01-04 -0.958751 -0.800054  1.991216  2.543021
2013-01-05  2.212769  0.252584  0.452832 -0.182894
2013-01-06 -0.091122  1.683142 -0.544830 -0.293907

Creating a DataFrame by passing a dict of objects that can be converted to series-like

In [5]:
df2 = pd.DataFrame({'A': 1.,
                            'B': pd.Timestamp('20130102'),
                            'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                            'D': np.array([3] * 4, dtype='int32'),
                            'E': pd.Categorical(["test", "train", "test", "train"]),
                            'F': 'foo'})

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
type(df2)

pandas.core.frame.DataFrame

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing Data

In [8]:
df2.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [9]:
df2.tail()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

#### DataFrame.to_numpy() 
 gives a NumPy representation of the underlying data. Note that this can be an expensive operation when your DataFrame has columns with different data types, which comes down to a fundamental difference between pandas and NumPy: NumPy arrays have one dtype for the entire array, while pandas DataFrames have one dtype per column. When you call DataFrame.to_numpy(), pandas will find the NumPy dtype that can hold all of the dtypes in the DataFrame. This may end up being object, which requires casting every value to a Python object.

In [12]:
df.to_numpy()

array([[ 0.04166395, -0.31678187,  0.26029064,  0.75819633],
       [ 0.01099337, -0.79326291, -0.49361239,  0.59826271],
       [ 0.68634643, -0.75106736, -0.96877883,  0.10545611],
       [-0.95875111, -0.80005358,  1.99121611,  2.54302108],
       [ 2.21276887,  0.25258426,  0.45283167, -0.18289411],
       [-0.09112174,  1.68314164, -0.54482993, -0.29390721]])

In [13]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

#### NOTE
DataFrame.to_numpy() does not include the index or column labels in the output.

describe() shows a quick statistic summary of your data:

In [15]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.316983 -0.120907  0.116186  0.588022
std    1.067137  0.973946  1.061676  1.044612
min   -0.958751 -0.800054 -0.968779 -0.293907
25%   -0.065593 -0.782714 -0.532026 -0.110807
50%    0.026329 -0.533925 -0.116661  0.351859
75%    0.525176  0.110243  0.404696  0.718213
max    2.212769  1.683142  1.991216  2.543021

Transposing your data:

In [16]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.041664    0.010993    0.686346   -0.958751    2.212769   -0.091122
B   -0.316782   -0.793263   -0.751067   -0.800054    0.252584    1.683142
C    0.260291   -0.493612   -0.968779    1.991216    0.452832   -0.544830
D    0.758196    0.598263    0.105456    2.543021   -0.182894   -0.293907

Sorting by an axis

In [17]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.758196  0.260291 -0.316782  0.041664
2013-01-02  0.598263 -0.493612 -0.793263  0.010993
2013-01-03  0.105456 -0.968779 -0.751067  0.686346
2013-01-04  2.543021  1.991216 -0.800054 -0.958751
2013-01-05 -0.182894  0.452832  0.252584  2.212769
2013-01-06 -0.293907 -0.544830  1.683142 -0.091122

Sorting by columns

In [20]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-04 -0.958751 -0.800054  1.991216  2.543021
2013-01-02  0.010993 -0.793263 -0.493612  0.598263
2013-01-03  0.686346 -0.751067 -0.968779  0.105456
2013-01-01  0.041664 -0.316782  0.260291  0.758196
2013-01-05  2.212769  0.252584  0.452832 -0.182894
2013-01-06 -0.091122  1.683142 -0.544830 -0.293907

## Getting
Selecting a single column, which yields a Series, equivalent to df.A:

In [21]:
df["A"]

2013-01-01    0.041664
2013-01-02    0.010993
2013-01-03    0.686346
2013-01-04   -0.958751
2013-01-05    2.212769
2013-01-06   -0.091122
Freq: D, Name: A, dtype: float64

Selecting via [], which slices the rows

In [22]:
df[0:3]

                   A         B         C         D
2013-01-01  0.041664 -0.316782  0.260291  0.758196
2013-01-02  0.010993 -0.793263 -0.493612  0.598263
2013-01-03  0.686346 -0.751067 -0.968779  0.105456

In [23]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.010993 -0.793263 -0.493612  0.598263
2013-01-03  0.686346 -0.751067 -0.968779  0.105456
2013-01-04 -0.958751 -0.800054  1.991216  2.543021

## Selection by label

For getting a cross section using a label:

In [24]:
df.loc[dates[0]]

A    0.041664
B   -0.316782
C    0.260291
D    0.758196
Name: 2013-01-01 00:00:00, dtype: float64

Selecting on a multi-axis by label:

In [25]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.041664 -0.316782
2013-01-02  0.010993 -0.793263
2013-01-03  0.686346 -0.751067
2013-01-04 -0.958751 -0.800054
2013-01-05  2.212769  0.252584
2013-01-06 -0.091122  1.683142

Showing label slicing, both endpoints are included:

In [27]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  0.010993 -0.793263
2013-01-03  0.686346 -0.751067
2013-01-04 -0.958751 -0.800054

Reduction in the dimensions of the returned object

In [31]:
df.loc['20130102', ['A', 'B']]

A    0.010993
B   -0.793263
Name: 2013-01-02 00:00:00, dtype: float64

For getting a scalar value:

In [32]:
df.loc[dates[0], 'A']

0.04166395325155942

For getting fast access to a scalar (equivalent to the prior method):

In [33]:
df.at[dates[0], 'A']

0.04166395325155942

## Selection by position

In [34]:
df.iloc[3]

A   -0.958751
B   -0.800054
C    1.991216
D    2.543021
Name: 2013-01-04 00:00:00, dtype: float64

By integer slices, acting similar to numpy/python:

In [35]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.958751 -0.800054
2013-01-05  2.212769  0.252584

By lists of integer position locations, similar to the numpy/python style

In [37]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.010993 -0.493612
2013-01-03  0.686346 -0.968779
2013-01-05  2.212769  0.452832

For slicing rows explicitly

In [38]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.010993 -0.793263 -0.493612  0.598263
2013-01-03  0.686346 -0.751067 -0.968779  0.105456

for slicing columns explicitly

In [39]:
df.iloc[:, 0:2]

                   A         B
2013-01-01  0.041664 -0.316782
2013-01-02  0.010993 -0.793263
2013-01-03  0.686346 -0.751067
2013-01-04 -0.958751 -0.800054
2013-01-05  2.212769  0.252584
2013-01-06 -0.091122  1.683142

For getting a value explicitly

In [40]:
df.iloc[1,1]

-0.7932629073404533

For getting fast access to a scalar (equivalent to the prior method):

In [41]:
df.iat[1,1]

-0.7932629073404533

## Boolean indexing

Using a single column’s values to select data.

In [42]:
df[df['A'] > 0]

                   A         B         C         D
2013-01-01  0.041664 -0.316782  0.260291  0.758196
2013-01-02  0.010993 -0.793263 -0.493612  0.598263
2013-01-03  0.686346 -0.751067 -0.968779  0.105456
2013-01-05  2.212769  0.252584  0.452832 -0.182894

Selecting values from a DataFrame where a boolean condition is met.

In [43]:
df[df>0]

                   A         B         C         D
2013-01-01  0.041664       NaN  0.260291  0.758196
2013-01-02  0.010993       NaN       NaN  0.598263
2013-01-03  0.686346       NaN       NaN  0.105456
2013-01-04       NaN       NaN  1.991216  2.543021
2013-01-05  2.212769  0.252584  0.452832       NaN
2013-01-06       NaN  1.683142       NaN       NaN

Using the isin() method for filtering:

In [44]:
df3 = df.copy()

In [45]:
df3['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df3

                   A         B         C         D      E
2013-01-01  0.041664 -0.316782  0.260291  0.758196    one
2013-01-02  0.010993 -0.793263 -0.493612  0.598263    one
2013-01-03  0.686346 -0.751067 -0.968779  0.105456    two
2013-01-04 -0.958751 -0.800054  1.991216  2.543021  three
2013-01-05  2.212769  0.252584  0.452832 -0.182894   four
2013-01-06 -0.091122  1.683142 -0.544830 -0.293907  three

In [47]:
df3[df3['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  0.686346 -0.751067 -0.968779  0.105456   two
2013-01-05  2.212769  0.252584  0.452832 -0.182894  four

## Setting

Setting a new column automatically aligns the data by the indexes

In [48]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))

In [49]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [50]:
df['F'] = s1

Setting values by label:

In [51]:
df.at[dates[0], 'A'] = 0

Setting values by position:

In [52]:
df.iat[0, 1] = 0

Setting by assigning with a NumPy array:

In [53]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [54]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.260291  5  NaN
2013-01-02  0.010993 -0.793263 -0.493612  5  1.0
2013-01-03  0.686346 -0.751067 -0.968779  5  2.0
2013-01-04 -0.958751 -0.800054  1.991216  5  3.0
2013-01-05  2.212769  0.252584  0.452832  5  4.0
2013-01-06 -0.091122  1.683142 -0.544830  5  5.0

A where operation with setting

In [55]:
df3 = df.copy()

df3[df3 > 0] = -df3

In [56]:
df3

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.260291 -5  NaN
2013-01-02 -0.010993 -0.793263 -0.493612 -5 -1.0
2013-01-03 -0.686346 -0.751067 -0.968779 -5 -2.0
2013-01-04 -0.958751 -0.800054 -1.991216 -5 -3.0
2013-01-05 -2.212769 -0.252584 -0.452832 -5 -4.0
2013-01-06 -0.091122 -1.683142 -0.544830 -5 -5.0

## Missing data
pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations. See the Missing Data section.

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [57]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [58]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [59]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.260291  5  NaN  1.0
2013-01-02  0.010993 -0.793263 -0.493612  5  1.0  1.0
2013-01-03  0.686346 -0.751067 -0.968779  5  2.0  NaN
2013-01-04 -0.958751 -0.800054  1.991216  5  3.0  NaN

To drop any rows that have missing data.

In [61]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  0.010993 -0.793263 -0.493612  5  1.0  1.0

In [62]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.260291  5  5.0  1.0
2013-01-02  0.010993 -0.793263 -0.493612  5  1.0  1.0
2013-01-03  0.686346 -0.751067 -0.968779  5  2.0  5.0
2013-01-04 -0.958751 -0.800054  1.991216  5  3.0  5.0

In [63]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [65]:
df_ = df1.fillna(value=5)

In [66]:
pd.isna(df_)

                A      B      C      D      F      E
2013-01-01  False  False  False  False  False  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False  False
2013-01-04  False  False  False  False  False  False

## Operations

In [67]:
df.mean()

A    0.310039
B   -0.068110
C    0.116186
D    5.000000
F    3.000000
dtype: float64

Same operation on the other axis:

In [68]:
df.mean(1)

2013-01-01    1.315073
2013-01-02    0.944824
2013-01-03    1.193300
2013-01-04    1.646482
2013-01-05    2.383637
2013-01-06    2.209438
Freq: D, dtype: float64

Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specified dimension

In [69]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [70]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.313654 -1.751067 -1.968779  4.0  1.0
2013-01-04 -3.958751 -3.800054 -1.008784  2.0  0.0
2013-01-05 -2.787231 -4.747416 -4.547168  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

## Apply

Applying functions to data

In [71]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.260291   5   NaN
2013-01-02  0.010993 -0.793263 -0.233322  10   1.0
2013-01-03  0.697340 -1.544330 -1.202101  15   3.0
2013-01-04 -0.261411 -2.344384  0.789116  20   6.0
2013-01-05  1.951358 -2.091800  1.241947  25  10.0
2013-01-06  1.860236 -0.408658  0.697117  30  15.0

In [72]:
df.apply(lambda x: x.max() - x.min())

A    3.171520
B    2.483195
C    2.959995
D    0.000000
F    4.000000
dtype: float64

## Histogramming

In [73]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    3
1    2
2    0
3    4
4    5
5    3
6    5
7    1
8    6
9    1
dtype: int32

In [74]:
s.value_counts()

5    2
3    2
1    2
6    1
4    1
2    1
0    1
dtype: int64

## String Methods

Series is equipped with a set of string processing methods in the str attribute that make it easy to operate on each element of the array, as in the code snippet below. Note that pattern-matching in str generally uses regular expressions by default (and in some cases always uses them).

In [75]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## Merge
## Concat
pandas provides various facilities for easily combining together Series and DataFrame objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

In [76]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.919444 -0.604350  0.474296 -0.272999
1  0.930086 -1.467868 -0.627519  1.130893
2 -0.446695 -0.062021  0.448736 -0.479624
3  1.947849  0.038983 -1.263464 -2.292113
4 -0.979016  1.072438  1.161004 -0.464660
5 -1.556252 -1.376362  1.073529  0.811356
6 -0.688320  1.003654 -0.125400  1.399629
7 -0.820789  2.336950 -1.440105 -1.588063
8 -0.739358 -3.461896  0.104572  0.839362
9  0.093936 -0.320690  1.083164 -0.584472

In [79]:
# break it into pieces
pieces = [df[:3], df[3:7], df[7:]]
pd.concat(pieces)

          0         1         2         3
0 -0.919444 -0.604350  0.474296 -0.272999
1  0.930086 -1.467868 -0.627519  1.130893
2 -0.446695 -0.062021  0.448736 -0.479624
3  1.947849  0.038983 -1.263464 -2.292113
4 -0.979016  1.072438  1.161004 -0.464660
5 -1.556252 -1.376362  1.073529  0.811356
6 -0.688320  1.003654 -0.125400  1.399629
7 -0.820789  2.336950 -1.440105 -1.588063
8 -0.739358 -3.461896  0.104572  0.839362
9  0.093936 -0.320690  1.083164 -0.584472

## Note
Adding a column to a DataFrame is relatively fast. However, adding a row requires a copy, and may be expensive. We recommend passing a pre-built list of records to the DataFrame constructor instead of building a DataFrame by iteratively appending records to it

## Join
SQL style merges

In [80]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [81]:
left

   key  lval
0  foo     1
1  foo     2

In [82]:
right

   key  rval
0  foo     4
1  foo     5

In [83]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [84]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})

right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

print(left)
print(right)

pd.merge(left, right, on='key')

   key  lval
0  foo     1
1  bar     2
   key  rval
0  foo     4
1  bar     5

   key  lval  rval
0  foo     1     4
1  bar     2     5

## Grouping

By “group by” we are referring to a process involving one or more of the following steps:

1. Splitting the data into groups based on some criteria

2. Applying a function to each group independently

3. Combining the results into a data structure

In [85]:
 df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                                 'foo', 'bar', 'foo', 'foo'],
                            'B': ['one', 'one', 'two', 'three',
                                  'two', 'two', 'one', 'three'],
                            'C': np.random.randn(8),
                            'D': np.random.randn(8)})
    

df

     A      B         C         D
0  foo    one  0.163355 -0.815847
1  bar    one  0.072458  0.497405
2  foo    two  0.438126  0.399392
3  bar  three  0.118210  2.510162
4  foo    two -0.748607 -0.472626
5  bar    two  0.574913 -0.137931
6  foo    one -2.436823  0.443285
7  foo  three  0.429138 -0.018759

Grouping and then applying the sum() function to the resulting groups.

In [86]:
df.groupby('A').sum()

            C         D
A
bar  0.765580  2.869637
foo -2.154809 -0.464556

In [87]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    0.072458  0.497405
    three  0.118210  2.510162
    two    0.574913 -0.137931
foo one   -2.273467 -0.372562
    three  0.429138 -0.018759
    two   -0.310480 -0.073234

## Reshaping

Stack

In [88]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                             'foo', 'foo', 'qux', 'qux'],
                             ['one', 'two', 'one', 'two',
                              'one', 'two', 'one', 'two']]))

In [89]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

df2 = df[:4]

df2

                     A         B
first second
bar   one    -1.072775 -0.086373
      two    -0.467739 -1.277806
baz   one     0.575152  1.325983
      two     0.533168 -0.594796

In [90]:
stacked = df2.stack()

stacked

first  second
bar    one     A   -1.072775
               B   -0.086373
       two     A   -0.467739
               B   -1.277806
baz    one     A    0.575152
               B    1.325983
       two     A    0.533168
               B   -0.594796
dtype: float64

With a “stacked” DataFrame or Series (having a MultiIndex as the index), the inverse operation of stack() is unstack(), which by default unstacks the last level:

In [91]:
stacked.unstack()

                     A         B
first second
bar   one    -1.072775 -0.086373
      two    -0.467739 -1.277806
baz   one     0.575152  1.325983
      two     0.533168 -0.594796

In [92]:
stacked.unstack(1)

second        one       two
first
bar   A -1.072775 -0.467739
      B -0.086373 -1.277806
baz   A  0.575152  0.533168
      B  1.325983 -0.594796

In [93]:
stacked.unstack(2)

                     A         B
first second
bar   one    -1.072775 -0.086373
      two    -0.467739 -1.277806
baz   one     0.575152  1.325983
      two     0.533168 -0.594796

## Time series

pandas has simple, powerful, and efficient functionality for performing resampling operations during frequency conversion (e.g., converting secondly data into 5-minutely data). This is extremely common in, but not limited to, financial applications.

In [94]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts.resample('5Min').sum()

2012-01-01    26711
Freq: 5T, dtype: int32

### Time zone representation

In [95]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

ts = pd.Series(np.random.randn(len(rng)), rng)

ts

2012-03-06   -0.967640
2012-03-07   -0.630814
2012-03-08    0.867187
2012-03-09   -1.777723
2012-03-10    0.837480
Freq: D, dtype: float64

In [96]:
ts_utc = ts.tz_localize('UTC')

ts_utc

2012-03-06 00:00:00+00:00   -0.967640
2012-03-07 00:00:00+00:00   -0.630814
2012-03-08 00:00:00+00:00    0.867187
2012-03-09 00:00:00+00:00   -1.777723
2012-03-10 00:00:00+00:00    0.837480
Freq: D, dtype: float64

Converting to another Timezone

In [97]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00   -0.967640
2012-03-06 19:00:00-05:00   -0.630814
2012-03-07 19:00:00-05:00    0.867187
2012-03-08 19:00:00-05:00   -1.777723
2012-03-09 19:00:00-05:00    0.837480
Freq: D, dtype: float64

Converting between time span representations:

In [98]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')

ts = pd.Series(np.random.randn(len(rng)), index=rng)

ts

2012-01-31    0.349997
2012-02-29    0.711346
2012-03-31   -1.757015
2012-04-30   -0.172420
2012-05-31    1.598085
Freq: M, dtype: float64

In [99]:
ps = ts.to_period()
ps

2012-01    0.349997
2012-02    0.711346
2012-03   -1.757015
2012-04   -0.172420
2012-05    1.598085
Freq: M, dtype: float64

In [100]:
ps.to_timestamp()

2012-01-01    0.349997
2012-02-01    0.711346
2012-03-01   -1.757015
2012-04-01   -0.172420
2012-05-01    1.598085
Freq: MS, dtype: float64

Converting between period and timestamp enables some convenient arithmetic functions to be used. In the following example, we convert a quarterly frequency with year ending in November to 9am of the end of the month following the quarter end:

In [101]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')

ts = pd.Series(np.random.randn(len(prng)), prng)

ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9

ts.head()

1990-03-01 09:00   -0.286828
1990-06-01 09:00   -1.883951
1990-09-01 09:00    0.568191
1990-12-01 09:00    0.896707
1991-03-01 09:00    0.601587
Freq: H, dtype: float64